/**
 * Bulgarian translation for bootstrap-wysihtml5
 */
(function($){
    $.fn.wysihtml5.locale["bg-BG"] = {
        font_styles: {
            normal: "Нормален текст",
            h1: "Заглавие 1",
            h2: "Заглавие 2",
            h3: "Заглавие 3"
        },
        emphasis: {
            bold: "Удебелен",
            italic: "Курсив",
            underline: "Подчертан"
        },
        lists: {
            unordered: "Неподреден списък",
            ordered: "Подреден списък",
            outdent: "Намали отстояние",
            indent: "Увеличи отстояние"
        },
        link: {
            insert: "Вмъкни връзка",
            cancel: "Отмени"
        },
        image: {
            insert: "Вмъкни картинка",
            cancel: "Отмени"
        },
        html: {
            edit: "Редакртирай HTML"
        },
        colours: {
            black: "Черен",
            silver: "Сребърен",
            gray: "Сив",
            maroon: "Коричневый",
            red: "Червен",
            purple: "Виолетов",
            green: "Зелен",
            olive: "Маслинен",
            navy: "Морско син",
            blue: "�/**
 * Bulgarian translation for bootstrap-wysihtml5
 */
(function($){
    $.fn.wysihtml5.locale["bg-BG"] = {
        font_styles: {
            normal: "Нормален текст",
            h1: "Заглавие 1",
            h2: "Заглавие 2",
            h3: "Заглавие 3"
        },
        emphasis: {
            bold: "Удебелен",
            italic: "Курсив",
            underline: "Подчертан"
        },
        lists: {
            unordered: "Неподреден списък",
            ordered: "Подреден списък",
            outdent: "Намали отстояние",
            indent: "Увеличи отстояние"
        },
        link: {
            insert: "Вмъкни връзка",
            cancel: "Отмени"
        },
        image: {
            insert: "Вмъкни картинка",
            cancel: "Отмени"
        },
        html: {
            edit: "Редакртирай HTML"
        },
        colours: {
            black: "Черен",
            silver: "Сребърен",
            gray: "Сив",
            maroon: "Коричневый",
            red: "Червен",
            purple: "Виолетов",
            green: "Зелен",
            olive: "Маслинен",
            navy: "Морско син",
            blue: "Син",
            orange: "Оранжев"
        }
    };
}(jQuery));

